import {defineStore} from "pinia";

export const useAboutStore = defineStore("aboutStore", {
    state: () => ({
        pageName: "Обо мне",
        title: "Меня зовут Алексей Бердников и я Frontend-разработчик",
        // text: "Стремлюсь чисто, структурировано и понятно для других писать код. Хочу погрузиться в командную разработку на Vue или React. Большое желание больше изучаться технологии в веб-разработке и создавать крутые, функциональные и полезные сайты",
        text: `Стремлюсь писать чистый, структурированный и понятный для других код. Моя цель — погрузиться в командную 
        разработку, где я смогу работать с современными технологиями, такими как Vue или React, и участвовать в создании 
        качественных веб-приложений. У меня есть большое желание развиваться в веб-разработке, изучать новые инструменты 
        и подходы, а также применять их на практике. Хочу создавать функциональные, удобные и полезные продукты, которые 
        будут решать задачи пользователей и приносить им удовольствие от использования.`,
        personalInfo: [
            {nameField: "День рождения", value: "24 марта 1998 г."},
            {nameField: "Возраст", value: "26"},
            {nameField: "Сайт", value: "В разработке"},
            {nameField: "Email", value: "aleksei240398@gmail.com"},
            {nameField: "Город", value: "Уфа"},
            {nameField: "Статус", value: "В поиске"},

        ],
        educationInfo: [
            {
                date: "2022-2023",
                title: "Курс \"React JS - путь самурая\"",
                text: "Прохождение бесплатного курса по React на youtube-канале IT-KAMASUTRA"
            },
            {
                date: "2018-2022",
                title: "Информатика и вычислительная техника",
                text: "СПИ (Филиал ИжГТУ)"
            },
            {
                date: "2013-2017",
                title: "Техник-программист",
                text: "Сарапульский политехнический колледж"
            }
        ],
        experienceInfo: [
            {
                date: "2025",
                title: "R1zz0ne (PET-проект)",
                text: "Разработка текущего сайта-портфолио"
            },
            {
                date: "2024-2025",
                title: "vueTasks (PET-проект)",
                text: "Разработка клиент-серверного приложения для управления задачами и проектами"
            },
            {
                date: "2023-2024",
                title: "petMessanger (PET-проект)",
                text: "Разработка клиент-серверного приложения - мессенджер"
            },
            {
                date: "2023",
                title: "TMHelper (собственная инициатива)",
                text: "Разработка приложений-скриптов для ускорения составления отчетов и рутинной работы на react-redux"
            },
            {
                date: "2022-2023",
                title: "Reports (собственная инициатива)",
                text: "Разработка приложений-скриптов для ускорения составления отчетов на шаблонизаторах ejs"
            },
        ]
    })
});